/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：featureExtraction.h                                              */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：2012.05.27                                                       */
/*----------------------------------------------------------------------------*/
/* 文件描述：特征提取                                                         */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _FEATURE_EXTRACTION_H_
#define _FEATURE_EXTRACTION_H_

#include "../SRParamSet/datadef.h"


/*****************************************************************
函数原型：CyVOID InitFeatureExtractionParam();
函数功能：初始化特征提取配置参数
*****************************************************************/
CyVOID InitFeatureExtractionParam();


/*****************************************************************
函数原型：CyVOID FeatureExtraction(FeatureSeq *pFeaSeq, VoiceBuffer *pVoiceBuff);
函数功能：对输入语音进行特征提取
输入参数：
VoiceBuffer *pVoiceBuff -- 语音数据缓冲区
输出参数：
FeatureSeq *pFeaSeq -- 输出后的特征序列
*****************************************************************/
CyVOID FeatureExtraction(FeatureSeq *pFeaSeq, VoiceBuffer *pVoiceBuff);

#endif