/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：FeatureTransform.h                                               */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：2012.06.01                                                       */
/*----------------------------------------------------------------------------*/
/* 文件描述：特征变换                                                         */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _FEATURE_TRANSFORM_H_
#define _FEATURE_TRANSFORM_H_

#include "../SRParamSet/asrconfig.h"
#include "../SRParamSet/typedef.h"
#include "../SRParamSet/datadef.h"


#if (ROBUST_OPT == ROBUST_CMVN)
/*****************************************************************
函数原型：CyVOID CMVN(FeatureSeq *pFeaSeq);
函数功能：倒谱特征归一化
输入参数：
FeatureSeq *pFeaSeq -- MFCC特征参数序列
输出参数：
FeatureSeq *pFeaSeq -- 变换后的特征参数序列
*****************************************************************/
CyVOID CMVN(FeatureSeq *pFeaSeq);

#elif (ROBUST_OPT == ROBUST_CMS)
/*****************************************************************
函数原型：CyVOID CMS(FeatureSeq *pFeaSeq);
函数功能：倒谱特征归一化
输入参数：
FeatureSeq *pFeaSeq -- MFCC特征参数序列
输出参数：
FeatureSeq *pFeaSeq -- 变换后的特征参数序列
*****************************************************************/
CyVOID CMS(FeatureSeq *pFeaSeq);
#endif

#endif