/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：MFCC.h                                              */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：2012.05.27                                                       */
/*----------------------------------------------------------------------------*/
/* 文件描述：特征提取                                                         */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _MFCC_FEATURE_H_
#define _MFCC_FEATURE_H_

#include "../SRParamSet/typedef.h"
#include "../SRParamSet/datadef.h"
#include "../SRParamSet/CyDebug.h"

/*****************************************************************
函数原型：CyVOID InitMfccParam();
函数功能：初始化MFCC参数的配置，包括三角滤波器系数、DCT变换矩阵、
          FFT初始化等
输入参数：
输出参数：
备注：初始化的代码可以事先计算好，并保存。以加快程序运行速度
*****************************************************************/
CyVOID InitMfccParam();

/*****************************************************************
函数原型：CyVOID GetFrmStaticMFCC(FVector feature, CyFLOAT *data, CyINT16 frmLength);
函数功能：获得一帧语音的静态MFCC特征，并存放入FVector中的0..FEATURE_BASE中
输入参数：
CyFLOAT *data -- 一帧语音数据
CyINT16 frmLength -- 帧长
输出参数：
FVector feature -- 输出一帧语音的特征向量
*****************************************************************/
CyVOID GetFrmStaticMFCC(FVector feature, CyFLOAT *data, CyINT16 frmLength);


// 该块代码在设定编译条件时，会自动注释，请勿在Block块中添加有效代码
BlockTRACE_Begin
CyVOID PrintCoef();
CyVOID FunctionTest();
BlockTRACE_End

#endif