/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：CyDebug.h                                                        */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：20120511                                                         */
/*----------------------------------------------------------------------------*/
/* 文件描述：用于程序调试，控制台输出                                         */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */

/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _CY_DEBUG_H_
#define _CY_DEBUG_H_

#include <stdio.h>

//#ifdef _CY_DEBUG_   //Enable by define _CY_DEBUG_
#if 1
//程序调试时显示中间结果，注意宏CyTRACE不支持换行，
//不要再其中完成逻辑操作，该宏应该独立成行，不要在其后面添加其他语句。
//使用方法与printf完全一样
#define CyTRACE printf

// 代码块测试
#define BlockTRACE_Begin
#define BlockTRACE_End

#else
#define CyTRACE /\
/ 

#define BlockTRACE_Begin	/\
*
#define BlockTRACE_End		*/

#endif


#endif