/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：CyMath.h                                                         */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：2012-05-27                                                          */
/*----------------------------------------------------------------------------*/
/* 文件描述：实现高效率的数学函数                                             */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _CYMATH_H_
#define _CYMATH_H_

#include <math.h>

// 自定义求根函数
#define CySQRT	sqrt

// 自定义正弦函数
#define CySIN	sin

// 自定义余弦函数
#define CyCOS	cos

// 自定义对数函数
#define CyLOG	log

// 自定义绝对值函数
#define CyABS	fabs

// 自定义指数函数
#define CyEXP	exp
//#define CyEXP	expl
#endif