/******************************************************************************/
/* 嵌入式语音识别程序     */
/* Copyright (C), 2009-2012, CQUPT. ME&ES., Speech Group.                     */
/******************************************************************************/
/*----------------------------------------------------------------------------*/
/* 文件名  ：nlp.h                                                            */
/* 创建人  ：蒲甫安，Pu.Fuan@gmail.com                                          */
/* 创建日期：2012.05.27                                                       */
/*----------------------------------------------------------------------------*/
/* 文件描述：特征参数序列非线性分段                                           */
/*----------------------------------------------------------------------------*/
/* 函数列表：                                                                 */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* 修改记录：                                                                 */
/* YYYY-MM-DD ：demo                                                           */
/******************************************************************************/

#ifndef _NONLINER_PARTITION_H_
#define _NONLINER_PARTITION_H_

#include "../SRParamSet/typedef.h"
#include "../SRParamSet/datadef.h"

/*****************************************************************
函数原型：CyVOID NonLinerPartition(FeatureSeq *pFeaSeq);
函数功能：对给定的特征序列计算分线性分段的分界点
输入参数：
FeatureSeq *pFeaSeq -- 特征参数序列
CyINT16 partitionNum -- 分块数
输出参数：
FeatureSeq *pFeaSeq -- 将结果保存在iNlpParam[NLP_N+1]中
*****************************************************************/
CyVOID NonLinerPartition(FeatureSeq *pFeaSeq, CyINT16 partitionNum);

#endif